DROP DATABASE IF EXISTS `Application`;

CREATE DATABASE `Application` CHARACTER SET utf8 COLLATE utf8_general_ci;

USE `Application`;

CREATE TABLE `Clients` (
	`iClientID` INT(6) UNSIGNED AUTO_INCREMENT,
	`sFirstName` VARCHAR(255) NOT NULL,
	`sLastName` VARCHAR(255) NOT NULL,
	`sFatherName` VARCHAR(255) NOT NULL,
	`dBirthDate` DATE NOT NULL,
	`iPassportSerial` INT(4) UNSIGNED NOT NULL,
	`iPassportNumber` INT(6) UNSIGNED NOT NULL,
	`dPassportDate` DATE NOT NULL,
	PRIMARY KEY (`iClientID`),
	INDEX `ClientIndex` (`sFirstName`, `sLastName`, `sFatherName`, `iPassportSerial`, `iPassportNumber`)
) ENGINE=InnoDB CHARSET=utf8 COLLATE=utf8_unicode_ci;

CREATE TABLE `Log` (
	`iLogID` INT(10) UNSIGNED AUTO_INCREMENT,
	`sEventName` VARCHAR(255) NOT NULL,
	`iIP` INT UNSIGNED NOT NULL,
	`dRecordTime` TIMESTAMP NOT NULL,
	PRIMARY KEY (`iLogID`)
) ENGINE=InnoDB CHARSET=utf8 COLLATE=utf8_unicode_ci;

INSERT INTO `Clients` VALUES (1, 'Пелагея', 'Снаткина', 'Владленовна', '1992-05-19', 5526, 944345, '2017-12-02');
INSERT INTO `Clients` VALUES (2, 'Пелагея', 'Дурченко', 'Капитонович', '1992-02-11', 9041, 323886, '2017-02-11');
INSERT INTO `Clients` VALUES (3, 'Михаил', 'Бородин', 'Давыдович', '1995-01-01', 6402, 196497, '2016-03-18');
INSERT INTO `Clients` VALUES (4, 'Никанор', 'Серых', 'Михаилович', '1991-11-15', 2390, 827707, '2016-08-10');
INSERT INTO `Clients` VALUES (5, 'Никифор', 'Крюков', 'Федотович', '1991-11-19', 8059, 607178, '2017-05-20');
INSERT INTO `Clients` VALUES (6, 'Ирина', 'Энгельгардта', 'Леонидовна', '1992-11-18', 4719, 209648, '2016-03-11');
INSERT INTO `Clients` VALUES (7, 'Эрнст', 'Досаев', 'Эрнстович', '1996-01-30', 8106, 745676, '2017-12-05');
INSERT INTO `Clients` VALUES (8, 'Денис', 'Корявов', 'Левович', '1991-11-02', 4548, 343799, '2016-02-11');
INSERT INTO `Clients` VALUES (9, 'Фаина', 'Кимаска', 'Ивановна', '1994-12-19', 3264, 247298, '2017-08-23');
INSERT INTO `Clients` VALUES (10, 'Михей', 'Решетов', 'Георгиевич', '1992-09-30', 7979, 337709, '2017-06-20');
INSERT INTO `Clients` VALUES (11, 'Порфирий', 'Купревич', 'Феоктистович', '1997-01-23', 8855, 214649, '2017-10-19');
INSERT INTO `Clients` VALUES (12, 'Полина', 'Абросимова', 'Захаровна', '1996-09-26', 4128, 196512, '2016-08-27');
INSERT INTO `Clients` VALUES (13, 'Татьяна', 'Фененко', 'Емельяновна', '1997-03-03', 8812, 171979, '2017-10-02');
INSERT INTO `Clients` VALUES (14, 'Кира', 'Тэна', 'Карповна', '1991-06-27', 8432, 906296, '2017-03-26');
INSERT INTO `Clients` VALUES (15, 'Наталия', 'Полякова', 'Афанасиевна', '1997-02-26', 2881, 526829, '2017-02-20');
INSERT INTO `Clients` VALUES (16, 'Элеонора', 'Киселева', 'Владиленовна', '1991-02-23', 2825, 691864, '2017-08-09');
INSERT INTO `Clients` VALUES (17, 'Марина', 'Пишенина', 'Мефодиевна', '1996-09-26', 5948, 179749, '2016-09-04');
INSERT INTO `Clients` VALUES (18, 'Виктор', 'Монаков', 'Адрианович', '1990-11-24', 5085, 239182, '2017-07-21');
INSERT INTO `Clients` VALUES (19, 'Филипп', 'Нагиев', 'Родионович', '1999-06-17', 8447, 260031, '2017-05-22');
INSERT INTO `Clients` VALUES (20, 'Юлия', 'Лукашенко', 'Емельяновна', '1997-11-09', 3340, 763265, '2016-12-15');
INSERT INTO `Clients` VALUES (21, 'Ипполит', 'Шлиппенбах', 'Потапович', '1991-05-20', 8992, 572184, '2017-12-20');
INSERT INTO `Clients` VALUES (22, 'Данила', 'Крайнов', 'Вадимович', '1990-07-26', 8714, 693141, '2016-01-07');
INSERT INTO `Clients` VALUES (23, 'Данила', 'Ижутин', 'Савелиевич', '1999-05-29', 3385, 960539, '2017-05-03');
INSERT INTO `Clients` VALUES (24, 'Савелий', 'Форофонтов', 'Эрнстович', '1998-04-24', 1558, 602205, '2016-09-11');
INSERT INTO `Clients` VALUES (25, 'Никон', 'Калдярв', 'Филимонович', '1992-02-14', 1385, 266097, '2016-03-13');
INSERT INTO `Clients` VALUES (26, 'Глеб', 'Игумнов', 'Онуфриевич', '1993-01-27', 8046, 704338, '2016-10-12');
INSERT INTO `Clients` VALUES (27, 'Любава', 'Черепанова', 'Романовна', '1995-03-24', 8618, 989174, '2016-01-25');
INSERT INTO `Clients` VALUES (28, '﻿Агата', 'Воеводина', 'Евгениевна', '1996-04-07', 9090, 629829, '2016-08-24');
INSERT INTO `Clients` VALUES (29, 'Серафим', 'Толбаев', 'Андриянович', '1996-07-02', 8073, 178062, '2017-09-09');
INSERT INTO `Clients` VALUES (30, 'Всеслава', 'Чаадаева', 'Федотовна', '1997-02-22', 9367, 252801, '2016-07-25');
INSERT INTO `Clients` VALUES (31, 'Зинаида', 'Винокурова', 'Яновна', '1991-03-26', 1148, 467209, '2017-11-04');
INSERT INTO `Clients` VALUES (32, 'Агафья', 'Кощеева', 'Семеновна', '1993-09-06', 6109, 765532, '2016-11-08');
INSERT INTO `Clients` VALUES (33, 'Леонид', 'Пороник', 'Давидович', '1993-10-17', 2369, 336859, '2017-11-13');
INSERT INTO `Clients` VALUES (34, 'Вадим', 'Романенко', 'Данилевич', '1992-11-14', 7770, 979404, '2016-06-21');
INSERT INTO `Clients` VALUES (35, 'Дарья', 'Островерха', 'Павеловна', '1992-06-20', 1282, 938592, '2016-11-15');
INSERT INTO `Clients` VALUES (36, 'Артем', 'Закиров', 'Никифорович', '1998-09-20', 9820, 267517, '2017-12-28');
INSERT INTO `Clients` VALUES (37, 'Ольга', 'Ковтунова', 'Святославовна', '1997-11-13', 8159, 433110, '2017-10-12');
INSERT INTO `Clients` VALUES (38, 'Ираида', 'Дульцева', 'Владленовна', '1995-12-21', 8605, 154704, '2017-04-22');
INSERT INTO `Clients` VALUES (39, 'Мария', 'Корявова', 'Станиславовна', '1993-01-20', 4302, 879607, '2017-04-21');
INSERT INTO `Clients` VALUES (40, 'Моисей', 'Шулепин', 'Назарович', '1997-03-16', 1582, 324207, '2017-05-26');
INSERT INTO `Clients` VALUES (41, 'Рубен', 'Копцев', 'Яковович', '1997-01-01', 6332, 600642, '2016-06-21');
INSERT INTO `Clients` VALUES (42, 'Борислав', 'Михалёв', 'Александрович', '1999-07-10', 5615, 411722, '2016-09-15');
INSERT INTO `Clients` VALUES (43, 'Дина', 'Тальдаева', 'Борисовна', '1997-08-10', 5334, 481819, '2017-06-18');
INSERT INTO `Clients` VALUES (44, '﻿Агата', 'Осолодкина', 'Феликсовна', '1994-12-31', 1314, 184255, '2017-10-22');
INSERT INTO `Clients` VALUES (45, 'Серафим', 'Астрединов', 'Измаилович', '1997-01-11', 1360, 278622, '2016-06-05');
INSERT INTO `Clients` VALUES (46, 'Всеволод', 'Фуриков', 'Филимонович', '1996-03-12', 8751, 548744, '2016-06-20');
INSERT INTO `Clients` VALUES (47, 'Ангелина', 'Чадова', 'Ростиславовна', '1993-05-07', 6020, 173378, '2017-07-12');
INSERT INTO `Clients` VALUES (48, 'Павел', 'Цицианов', 'Никанорович', '1998-01-15', 6245, 169408, '2017-02-12');
INSERT INTO `Clients` VALUES (49, 'Валерия', 'Сигачёва', 'Трофимовна', '1998-02-24', 9060, 238863, '2017-07-07');
INSERT INTO `Clients` VALUES (50, 'Аскольд', 'Чичваркин', 'Ираклиевич', '1991-09-07', 5177, 818531, '2017-09-17');
INSERT INTO `Clients` VALUES (51, 'Ким', 'Ярошевский', 'Фомевич', '1997-02-20', 8037, 195512, '2016-01-27');
INSERT INTO `Clients` VALUES (52, 'Маргарита', 'Протасова', 'Федоровна', '1996-04-27', 2187, 101713, '2016-10-12');
INSERT INTO `Clients` VALUES (53, 'Инесса', 'Ясюлевича', 'Юлиевна', '1993-01-23', 5545, 114778, '2016-06-05');
INSERT INTO `Clients` VALUES (54, 'Мирослава', 'Смольникова', 'Олеговна', '1999-05-25', 9073, 442688, '2016-10-17');
INSERT INTO `Clients` VALUES (55, 'Юлий', 'Угольников', 'Игнатиевич', '1993-11-18', 8331, 555363, '2016-04-06');
INSERT INTO `Clients` VALUES (56, 'Софья', 'Дежнёва', 'Владленовна', '1995-08-24', 5340, 912055, '2017-04-22');
INSERT INTO `Clients` VALUES (57, 'Вера', 'Талызина', 'Георгиевна', '1991-08-15', 6565, 978125, '2016-08-06');
INSERT INTO `Clients` VALUES (58, 'Анисья', 'Голованова', 'Данииловна', '1998-02-04', 2746, 527590, '2016-08-17');
INSERT INTO `Clients` VALUES (59, 'Матвей', 'Статник', 'Евлампиевич', '1992-03-26', 9833, 680814, '2016-06-03');
INSERT INTO `Clients` VALUES (60, 'Евдоким', 'Ясеневский', 'Иннокентиевич', '1994-10-06', 8756, 549983, '2016-03-24');
INSERT INTO `Clients` VALUES (61, 'Юнона', 'Круминь', 'Евгениевна', '1995-04-23', 5658, 520167, '2016-12-05');
INSERT INTO `Clients` VALUES (62, 'Ростислав', 'Эмский', 'Даниилович', '1990-01-31', 2093, 918953, '2016-02-02');
INSERT INTO `Clients` VALUES (63, 'Максимильян', 'Курбанов', 'Яковович', '1999-10-24', 3900, 224054, '2017-12-26');
INSERT INTO `Clients` VALUES (64, 'Наталья', 'Погребняка', 'Степановна', '1992-12-23', 8557, 361333, '2017-10-02');
INSERT INTO `Clients` VALUES (65, 'Евгений', 'Ловзанский', 'Захарович', '1998-01-08', 3818, 587986, '2017-09-14');
INSERT INTO `Clients` VALUES (66, 'Алиса', 'Низова', 'Николаевна', '1992-01-08', 5396, 876578, '2016-09-19');
INSERT INTO `Clients` VALUES (67, 'Анастасия', 'Галкина', 'Мефодиевна', '1993-02-13', 7573, 553011, '2017-06-29');
INSERT INTO `Clients` VALUES (68, 'Арсений', 'Комягин', 'Феликсович', '1991-12-02', 7825, 614602, '2016-09-05');
INSERT INTO `Clients` VALUES (69, 'Агния', 'Кутякова', 'Захаровна', '1995-08-22', 9345, 988923, '2017-11-28');
INSERT INTO `Clients` VALUES (70, 'Доминика', 'Яшина', 'Иосифовна', '1993-09-27', 6676, 663465, '2017-02-23');
INSERT INTO `Clients` VALUES (71, 'Елена', 'Нагиева', 'Казимировна', '1991-07-13', 3595, 179244, '2016-11-22');
INSERT INTO `Clients` VALUES (72, 'Чеслав', 'Матеров', 'Никонович', '1991-07-25', 3188, 866804, '2016-01-11');
INSERT INTO `Clients` VALUES (73, 'Инна', 'Абоимова', 'Германовна', '1997-04-25', 6328, 514869, '2017-03-29');
INSERT INTO `Clients` VALUES (74, 'Бронислав', 'Фетисов', 'Титович', '1995-05-29', 1011, 228900, '2016-10-10');
INSERT INTO `Clients` VALUES (75, 'Евдоким', 'Кратенко', 'Чеславович', '1995-12-16', 1205, 276449, '2017-02-15');
INSERT INTO `Clients` VALUES (76, 'Людмила', 'Цуканова', 'Захаровна', '1994-12-09', 6072, 177966, '2016-01-26');
INSERT INTO `Clients` VALUES (77, 'Эмма', 'Гончарова', 'Михеевна', '1993-02-06', 9150, 666550, '2017-12-31');
INSERT INTO `Clients` VALUES (78, 'Кондрат', 'Актжанов', 'Сократович', '1995-02-02', 2423, 371853, '2016-05-01');
INSERT INTO `Clients` VALUES (79, 'Варвара', 'Кирпа', 'Тимуровна', '1997-10-04', 1780, 990193, '2017-09-21');
INSERT INTO `Clients` VALUES (80, 'Агафон', 'Ли', 'Семенович', '1994-08-28', 4836, 779147, '2016-10-28');
INSERT INTO `Clients` VALUES (81, 'Лев', 'Монаков', 'Святославович', '1994-01-09', 9346, 745088, '2017-03-23');
INSERT INTO `Clients` VALUES (82, 'Ярослав', 'Зворыгин', 'Геннадиевич', '1997-08-05', 6506, 963293, '2016-07-01');
INSERT INTO `Clients` VALUES (83, 'Архип', 'Архипов', 'Гордеевич', '1998-02-13', 5924, 503713, '2016-06-19');
INSERT INTO `Clients` VALUES (84, 'Демьян', 'Житков', 'Ермолаевич', '1999-09-07', 3314, 638086, '2016-03-23');
INSERT INTO `Clients` VALUES (85, 'Тамара', 'Агейкина', 'Емельяновна', '1994-01-22', 2162, 403415, '2016-10-24');
INSERT INTO `Clients` VALUES (86, 'Злата', 'Радченко', 'Ефимовна', '1999-11-16', 1566, 790099, '2016-10-28');
INSERT INTO `Clients` VALUES (87, 'Варвара', 'Кичеева', 'Геннадиевна', '1993-07-05', 4950, 205057, '2016-05-11');
INSERT INTO `Clients` VALUES (88, 'Ефросинья', 'Арнаутова', 'Федотовна', '1994-06-11', 4644, 260178, '2017-07-03');
INSERT INTO `Clients` VALUES (89, 'Ефросиния', 'Яковлева', 'Тимуровна', '1990-05-29', 6178, 965102, '2016-07-05');
INSERT INTO `Clients` VALUES (90, 'Ангелина', 'Казанькова', 'Анатолиевна', '1998-01-14', 7478, 370084, '2017-11-07');
INSERT INTO `Clients` VALUES (91, 'Владлена', 'Жарикова', 'Алексеевна', '1995-03-17', 7702, 888970, '2016-06-18');
INSERT INTO `Clients` VALUES (92, 'Владислава', 'Румянцева', 'Иосифовна', '1992-06-11', 9831, 786946, '2016-03-16');
INSERT INTO `Clients` VALUES (93, 'Аристарх', 'Усилов', 'Прокофиевич', '1998-04-23', 7929, 449196, '2017-10-12');
INSERT INTO `Clients` VALUES (94, 'Алина', 'Нилова', 'Игнатиевна', '1994-06-25', 6746, 355189, '2016-07-17');
INSERT INTO `Clients` VALUES (95, 'Ефрем', 'Илюхин', 'Еремеевич', '1991-10-19', 6867, 368355, '2017-11-24');
INSERT INTO `Clients` VALUES (96, 'Георгий', 'Лесничий', 'Капитонович', '1997-05-19', 2902, 997439, '2017-02-10');
INSERT INTO `Clients` VALUES (97, 'Майя', 'Коротаева', 'Ипполитовна', '1997-09-12', 7845, 370679, '2017-03-22');
INSERT INTO `Clients` VALUES (98, 'Всеволод', 'Кедров', 'Данилевич', '1993-04-02', 7793, 834463, '2016-09-13');
INSERT INTO `Clients` VALUES (99, 'Мартын', 'Язвецов', 'Евлампиевич', '1997-11-10', 1963, 313300, '2016-09-26');
INSERT INTO `Clients` VALUES (100, 'Любава', 'Рыжкова', 'Давидовна', '1992-02-15', 6354, 955207, '2016-11-22');